_org/android平台ndk开发知识汇总.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+LAYOUT: post
#+AUTHOR: tiankai
#+DATE: 2019-06-07 五 17:57
#+TITLE: Android平台NDK开发知识汇总
#+DESCRIPTION: Android NDK
#+TAGS: Android
#+CATEGORIES: Android

* JNI定义的数据类型
JNI 中定义的数据类型和 Java 中定义的数据类型是一一对应的关系。JNI 中定义的数据类
型分为基本数据类型和引用类型。基本数据类型见下表:
#+CAPTION:  JNI 基本数据类型
#+STARTUP: align shrink
| JNI 类型 | Java 类型 | 描述         |
|----------+-----------+--------------|
| void     | void      | 无类型       |
| jboolean | boolean   | 布尔型       |
| jbyte    | byte      | 字节型       |
| jchar    | char      | 字符型       |
| jshort   | short     | 短整型       |
| jint     | int       | 整型         |
| jlong    | long      | 长整型       |
| jfloat   | float     | 浮点型       |
| jdouble  | bouble    | 双精度浮点型 |

引用类型：
#+CAPTION: JNI 的引用类型
| JNI 类型      | Java 类型 | 描述       |
|---------------+-----------+------------|
| jstring       | String    | 字符串对象 |
| jobjectArray  | Object[]  | 对象数组   |
| jbooleanArray | boolean[] | 布尔型数组 |
| jbyteArray    | byte[]    |            |
| jcharArray    | char[]    |            |
| jshortArray   | sort[]    |            |
| jintArray     | int[]     |            |
| jlongArray    | long[]    |            |
| jfloatArray   | float[]   |            |
| jdoubleArra   | bouble[]  |            |
| jthrowable    | Throwable |            |

除了以上的类型之外,还有一点需要注意, Java 语言的中的数据类型的签名如下表所示:
#+CAPTION: 数据类型的签名
| Java 类型 | signature          |
|-----------+--------------------|
| boolean   | Z                  |
| byte      | B                  |
| char      | C                  |
| short     | S                  |
| int       | I                  |
| long      | J                  |
| float     | F                  |
| double    | D                  |
| void      | void               |
| String    | Ljava/lang/String; |
| Object    | Ljava/lang/Object; |


** Gradle中配置 cmak
在 gradle 的配置文件中配置 cmake 的目的是为了让 gradle 在构建 APK 时能够自动的去
构建 C/C++代码,也就是说要在 gradle 进行配置,以便让 Android Studio 能够识别 C/C++
代码.要将下面的代码添加到 module 的 build.gradle 文件中.
#+begin_example
android {
  ...
  defaultConfig {
    ...
    // This block is different from the one you use to link Gradle
    // to your CMake build script.
    externalNativeBuild {
      cmake {
        ...
        // Use the following syntax when passing arguments to variables:
        // arguments "-DVAR_NAME=ARGUMENT".
        arguments "-DANDROID_ARM_NEON=TRUE",
        // If you're passing multiple arguments to a variable, pass them together:
        // arguments "-DVAR_NAME=ARG_1 ARG_2"
        // The following line passes 'rtti' and 'exceptions' to 'ANDROID_CPP_FEATURES'.
                  "-DANDROID_CPP_FEATURES=rtti exceptions"
       // add filter to api
       adbFilters "armeabi-v7a", "armeabi-v8a", "x86", "x86-64"
      }
    }
  }
  buildTypes {...}

  // Use this block to link Gradle to your CMake build script.
  externalNativeBuild {
    cmake {
        path file('../CmakeLists.txt')
    }
  }
}
#+end_example



** Cmake语法
从 Android studio2.2 开始支持Cmake编译 C/C++代码,而且目前最新版的 Android
studio,使用 cmake 作为默认的构建工具.接下来我们看一下最简单的CmakeLists.txt.
#+begin_example
cmake_minimum_required(VERSION 3.4.1)
add_library( # 生成的so库名称，此处生成的so文件名称是libnative-lib.so
             native-lib
             # SHARED是动态库，会被动态链接，在运行时被加载
             # STATIC：静态库，是目标文件的归档文件，在链接其它目标的时候使用
             # MODULE：模块库，是不会被链接到其它目标中的插件
             SHARED
             # 资源路径是相对路径，相对于本CMakeLists.txt所在目录
             src/main/cpp/native-lib.cpp )
# 从系统查找依赖库
find_library( # android系统每个类型的库会存放一个特定的位置，而log库存放在log-lib中
              log-lib
              # android系统在c环境下打log到logcat的库
              log )
# 配置库的链接（依赖关系）
target_link_libraries( # 目标库
                       native-lib
                       # 依赖于
                       ${log-lib} )
#+end_example


如果想在CmakeList s.txt 中添加另一个 so 库的依赖, CmakeListts.txt 如下所示:
#+BEGIN_EXAMPLE
cmake_minimum_required(VERSION 3.4.1)
add_library( 
            pre-build-lib
            STATIC
            src/main/cpp/pre-build-lib
)
add_library( native-lib
             SHARED
             src/main/cpp/native-lib.cpp 
             src/main/cpp/native-lib2.cpp)
# 从系统查找依赖库
find_library( # android系统每个类型的库会存放一个特定的位置，而log库存放在log-lib中
              log-lib
              # android系统在c环境下打log到logcat的库
              log )
# 配置库的链接（依赖关系）
target_link_libraries( # 目标库
                       native-lib
                       # 依赖于
                       ${log-lib} 
                       pre-build-lib
                       )

#+END_EXAMPLE


