_posts/2019-06-07-android平台ndk开发知识汇总.html
---
date: 2019-06-07
tags: 
- Android
author: tiankai
layout: post
title: Android平台NDK开发知识汇总
excerpt: Android NDK
categories: 
- Android
---

<div id="outline-container-orgc98f3d9" class="outline-2">
<h2 id="orgc98f3d9">JNI定义的数据类型</h2>
<div class="outline-text-2" id="text-orgc98f3d9">
<p>
JNI 中定义的数据类型和 Java 中定义的数据类型是一一对应的关系。JNI 中定义的数据类
型分为基本数据类型和引用类型。基本数据类型见下表:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">JNI 类型</th>
<th scope="col" class="org-left">Java 类型</th>
<th scope="col" class="org-left">描述</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">void</td>
<td class="org-left">void</td>
<td class="org-left">无类型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jboolean</td>
<td class="org-left">boolean</td>
<td class="org-left">布尔型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jbyte</td>
<td class="org-left">byte</td>
<td class="org-left">字节型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">jchar</td>
<td class="org-left">char</td>
<td class="org-left">字符型</td>
</tr>

<tr>
<td class="org-left">jshort</td>
<td class="org-left">short</td>
<td class="org-left">短整型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jint</td>
<td class="org-left">int</td>
<td class="org-left">整型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jlong</td>
<td class="org-left">long</td>
<td class="org-left">长整型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jfloat</td>
<td class="org-left">float</td>
<td class="org-left">浮点型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jdouble</td>
<td class="org-left">bouble</td>
<td class="org-left">双精度浮点型</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
引用类型：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> JNI 的引用类型</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">JNI 类型</th>
<th scope="col" class="org-left">Java 类型</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">jstring</td>
<td class="org-left">String</td>
<td class="org-left">字符串对象</td>
</tr>

<tr>
<td class="org-left">jobjectArray</td>
<td class="org-left">Object[]</td>
<td class="org-left">对象数组</td>
</tr>

<tr>
<td class="org-left">jbooleanArray</td>
<td class="org-left">boolean[]</td>
<td class="org-left">布尔型数组</td>
</tr>

<tr>
<td class="org-left">jbyteArray</td>
<td class="org-left">byte[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jcharArray</td>
<td class="org-left">char[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jshortArray</td>
<td class="org-left">sort[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jintArray</td>
<td class="org-left">int[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jlongArray</td>
<td class="org-left">long[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jfloatArray</td>
<td class="org-left">float[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jdoubleArra</td>
<td class="org-left">bouble[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">jthrowable</td>
<td class="org-left">Throwable</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
除了以上的类型之外,还有一点需要注意, Java 语言的中的数据类型的签名如下表所示:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> 数据类型的签名</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Java 类型</th>
<th scope="col" class="org-left">signature</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-left">Z</td>
</tr>

<tr>
<td class="org-left">byte</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-left">char</td>
<td class="org-left">C</td>
</tr>

<tr>
<td class="org-left">short</td>
<td class="org-left">S</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-left">I</td>
</tr>

<tr>
<td class="org-left">long</td>
<td class="org-left">J</td>
</tr>

<tr>
<td class="org-left">float</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-left">D</td>
</tr>

<tr>
<td class="org-left">void</td>
<td class="org-left">void</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">Ljava/lang/String;</td>
</tr>

<tr>
<td class="org-left">Object</td>
<td class="org-left">Ljava/lang/Object;</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org0327339" class="outline-3">
<h3 id="org0327339">Gradle中配置 cmak</h3>
<div class="outline-text-3" id="text-org0327339">
<p>
在 gradle 的配置文件中配置 cmake 的目的是为了让 gradle 在构建 APK 时能够自动的去
构建 C/C++代码,也就是说要在 gradle 进行配置,以便让 Android Studio 能够识别 C/C++
代码.要将下面的代码添加到 module 的 build.gradle 文件中.
</p>
<pre class="example">
android {
  ...
  defaultConfig {
    ...
    // This block is different from the one you use to link Gradle
    // to your CMake build script.
    externalNativeBuild {
      cmake {
        ...
        // Use the following syntax when passing arguments to variables:
        // arguments "-DVAR_NAME=ARGUMENT".
        arguments "-DANDROID_ARM_NEON=TRUE",
        // If you're passing multiple arguments to a variable, pass them together:
        // arguments "-DVAR_NAME=ARG_1 ARG_2"
        // The following line passes 'rtti' and 'exceptions' to 'ANDROID_CPP_FEATURES'.
                  "-DANDROID_CPP_FEATURES=rtti exceptions"
       // add filter to api
       adbFilters "armeabi-v7a", "armeabi-v8a", "x86", "x86-64"
      }
    }
  }
  buildTypes {...}

  // Use this block to link Gradle to your CMake build script.
  externalNativeBuild {
    cmake {
        path file('../CmakeLists.txt')
    }
  }
}
</pre>
</div>
</div>



<div id="outline-container-orgcefd555" class="outline-3">
<h3 id="orgcefd555">Cmake语法</h3>
<div class="outline-text-3" id="text-orgcefd555">
<p>
从 Android studio2.2 开始支持Cmake编译 C/C++代码,而且目前最新版的 Android
studio,使用 cmake 作为默认的构建工具.接下来我们看一下最简单的CmakeLists.txt.
</p>
<pre class="example">
cmake_minimum_required(VERSION 3.4.1)
add_library( # 生成的so库名称，此处生成的so文件名称是libnative-lib.so
             native-lib
             # SHARED是动态库，会被动态链接，在运行时被加载
             # STATIC：静态库，是目标文件的归档文件，在链接其它目标的时候使用
             # MODULE：模块库，是不会被链接到其它目标中的插件
             SHARED
             # 资源路径是相对路径，相对于本CMakeLists.txt所在目录
             src/main/cpp/native-lib.cpp )
# 从系统查找依赖库
find_library( # android系统每个类型的库会存放一个特定的位置，而log库存放在log-lib中
              log-lib
              # android系统在c环境下打log到logcat的库
              log )
# 配置库的链接（依赖关系）
target_link_libraries( # 目标库
                       native-lib
                       # 依赖于
                       ${log-lib} )
</pre>


<p>
如果想在CmakeList s.txt 中添加另一个 so 库的依赖, CmakeListts.txt 如下所示:
</p>
<pre class="example">
cmake_minimum_required(VERSION 3.4.1)
add_library( 
            pre-build-lib
            STATIC
            src/main/cpp/pre-build-lib
)
add_library( native-lib
             SHARED
             src/main/cpp/native-lib.cpp 
             src/main/cpp/native-lib2.cpp)
# 从系统查找依赖库
find_library( # android系统每个类型的库会存放一个特定的位置，而log库存放在log-lib中
              log-lib
              # android系统在c环境下打log到logcat的库
              log )
# 配置库的链接（依赖关系）
target_link_libraries( # 目标库
                       native-lib
