_org/android平台ndk开发知识汇总.org
** JNI注册的方式
 java 要想调用 C/C++代码,java 必须找到相应的 C/C++代码,所以 C/C++代码需要进行注
 册,以便 java 代码能够找到相应的 C/C++代码.JNI 支持的注册方式有两种:静态注册方式
 和动态注册方式.先看静态的注册方式:
#+begin_src C++
extern "C"
JNIEXPORT void JNICALL
Java_com_ndk_lingxiao_ndkproject_Hello_callJavaStaticMethod(JNIEnv *env, jclass thiz) {
    jclass clazz = NULL;
    jmethodID method_id = NULL;
    jstring str_log = NULL;

    clazz = env->FindClass("com/pacakge/Hello");
    if (clazz == NULL){
        return;
    }
    method_id = env->GetStaticMethodID(clazz,"staticMethod","(Ljava/lang/String;)V");
    if (method_id == NULL){
        return;
    }
    str_log = env->NewStringUTF("c++ 调用java的静态方法");
    env->CallStaticVoidMethod(clazz,method_id,str_log);

    env->DeleteLocalRef(clazz);
    env->DeleteLocalRef(str_log);
    return ;
}
#+end_src
在静态注册的方式的函数定义部分是比较固定的写法,我们以此来解释一下: 
1. *extern "C"*:表示C++代码能够调用其他 C 代码,主要用来兼容 C 语言.
2. *JNIEXPORT*: 这个宏的定义如下,这个宏表示这函数对外是可见的,以便于 java 代码能
   够找到这个函数.
   #+begin_src C++
   #define JNIEXPORT  __attribute__ ((visibility ("default")))
   #+end_src
3. *Java_com_ndk_lingxiao_ndkproject_Hello_callJavaStaticMethod*:函数的名称,这个
   函数名是有固定的格式的,格式为:
#+begin_example
Java_类的全路径名_方法名(在类的全路径名中要将"/"装换成"_", 这个类定义这个 native 方法所在的类)
#+end_example
4. *JNIEnv* env*: JNI调用的运行环境的指针,每个函数的第一个参数都是一个 JNIEnv*类
   型.
5. *jclass* thiz: 如果注册的类是一个非静态类,这个thiz 指的的是调用这个方法的类实
   例化后的对象.如果注册的类是一个静态类,这个 thiz 指的是就是这个类.


接下来我们看动态注册的方式,在动态注册的方式有又分为两种形式:C 形式 和 C++形式,接
下来我们会分别对这两种形式作介绍.
先看 C 语言版本的动态注册方式:

#+begin_src C
static const char *mainClass = "payegis/com/jstest/MainActivity"; // path of Java file

#define NELEM(x) ((int) (sizeof(x) / sizeof((x)[0])))

JNIEXPORT jstring JNICALL get_hello(JNIEnv *env, jclass clazz) {
    return (*env)->NewStringUTF(env, "hello from jni");
}

static JNINativeMethod g_methods[] = {
        {"getHello",     "()Ljava/lang/String;", (void *) get_hello},
};

JNIEXPORT jint JNI_OnLoad(JavaVM *vm, void *reserved) {
    JNIEnv *env = NULL;
    jint result = JNI_ERR;

    if ((*vm)->GetEnv(vm, (void **) &env, JNI_VERSION_1_6) != JNI_OK) {
        return JNI_ERR;
    }

    assert(env != NULL);
    
    clazz = (*env)->FindClass(env, className);
    if (clazz == NULL) {
        return JNI_ERR;
    }
    // C 与 C++ 不同之处,
    if ((*env)->RegisterNatives(env, clazz, gMethods, NELEM(gMethods)) < 0) {
        return JNI_ERR;
    }
    // 代表 JNI 不同的版本.
    result = JNI_VERSION_1_6;

    return result;
}

#+end_src


C++版本的动态注册如下所示：

#+begin_src C++
static const char *mainClass = "payegis/com/jstest/MainActivity"; // path of Java file

#define NELEM(x) ((int) (sizeof(x) / sizeof((x)[0])))



JNIEXPORT jstring JNICALL get_hello(JNIEnv *env, jclass clazz) {
    return env->NewStringUTF("hello from jni");
}


static JNINativeMethod g_methods[] = {
        {"getHello",     "()Ljava/lang/String;", (void *) get_hello},
};


JNIEXPORT jint JNICALL JNI_OnLoad(JavaVM *jvm, void *reserved) {
    JNIEnv *env = NULL;
    jint result = JNI_FALSE;

    //获取env指针
    if (jvm->GetEnv((void **) &env, JNI_VERSION_1_6) != JNI_OK) {
        return result;
    }
    if (env == NULL) {
        return result;
    }
    //获取类引用，写类的全路径（包名+类名）。FindClass等JNI函数将在后面讲解
    jclass clazz = env->FindClass(mainClass);
    if (clazz == NULL) {
        return result;
    }
    //注册方法
    if (env->RegisterNatives(clazz, g_methods, NELEM(g_methods)) < 0) {
        return result;
    }
    //成功
    result = JNI_VERSION_1_6;
    return result;
}

#+end_src


