_posts/2019-06-07-android平台ndk开发知识汇总.html
                       # 依赖于
                       ${log-lib} 
                       pre-build-lib
                       )

</pre>
</div>
</div>


<div id="outline-container-org1b5f9f4" class="outline-3">
<h3 id="org1b5f9f4">JNI注册的方式</h3>
<div class="outline-text-3" id="text-org1b5f9f4">
<p>
java 要想调用 C/C++代码,java 必须找到相应的 C/C++代码,所以 C/C++代码需要进行注
册,以便 java 代码能够找到相应的 C/C++代码.JNI 支持的注册方式有两种:静态注册方式
和动态注册方式.先看静态的注册方式:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #4f97d7; font-weight: bold;">extern</span> <span style="color: #2d9574;">"C"</span>
JNIEXPORT <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">JNICALL</span>
Java_com_ndk_lingxiao_ndkproject_Hello_callJavaStaticMethod<span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span> *<span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">thiz</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span> = <span style="color: #a45bad;">NULL</span>;
    <span style="color: #ce537a; font-weight: bold;">jmethodID</span> <span style="color: #7590db;">method_id</span> = <span style="color: #a45bad;">NULL</span>;
    <span style="color: #ce537a; font-weight: bold;">jstring</span> <span style="color: #7590db;">str_log</span> = <span style="color: #a45bad;">NULL</span>;

    clazz = env-&gt;FindClass<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"com/pacakge/Hello"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>clazz == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">){</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>
    method_id = env-&gt;GetStaticMethodID<span style="color: #bc6ec5;">(</span>clazz,<span style="color: #2d9574;">"staticMethod"</span>,<span style="color: #2d9574;">"(Ljava/lang/String;)V"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>method_id == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">){</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span>;
    <span style="color: #bc6ec5;">}</span>
    str_log = env-&gt;NewStringUTF<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"c++ &#35843;&#29992;java&#30340;&#38745;&#24577;&#26041;&#27861;"</span><span style="color: #bc6ec5;">)</span>;
    env-&gt;CallStaticVoidMethod<span style="color: #bc6ec5;">(</span>clazz,method_id,str_log<span style="color: #bc6ec5;">)</span>;

    env-&gt;DeleteLocalRef<span style="color: #bc6ec5;">(</span>clazz<span style="color: #bc6ec5;">)</span>;
    env-&gt;DeleteLocalRef<span style="color: #bc6ec5;">(</span>str_log<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> ;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
在静态注册的方式的函数定义部分是比较固定的写法,我们以此来解释一下: 
</p>
<ol class="org-ol">
<li><b>extern "C"</b>:表示C++代码能够调用其他 C 代码,主要用来兼容 C 语言.</li>
<li><p>
<b>JNIEXPORT</b>: 这个宏的定义如下,这个宏表示这函数对外是可见的,以便于 java 代码能
够找到这个函数.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">JNIEXPORT</span>  <span style="color: #4f97d7; font-weight: bold;">__attribute__</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>visibility <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"default"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div></li>
<li><b>Java<sub>com</sub><sub>ndk</sub><sub>lingxiao</sub><sub>ndkproject</sub><sub>Hello</sub><sub>callJavaStaticMethod</sub></b>:函数的名称,这个
函数名是有固定的格式的,格式为:</li>
</ol>
<pre class="example">
Java_类的全路径名_方法名(在类的全路径名中要将"/"装换成"_", 这个类定义这个 native 方法所在的类)
</pre>
<ol class="org-ol">
<li><b>JNIEnv</b> env*: JNI调用的运行环境的指针,每个函数的第一个参数都是一个 JNIEnv*类
型.</li>
<li><b>jclass</b> thiz: 如果注册的类是一个非静态类,这个thiz 指的的是调用这个方法的类实
例化后的对象.如果注册的类是一个静态类,这个 thiz 指的是就是这个类.</li>
</ol>


<p>
接下来我们看动态注册的方式,在动态注册的方式有又分为两种形式:C 形式 和 C++形式,接
下来我们会分别对这两种形式作介绍.
先看 C 语言版本的动态注册方式:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">mainClass</span> = <span style="color: #2d9574;">"payegis/com/jstest/MainActivity"</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">path of Java file</span>

<span style="color: #bc6ec5;">#define</span> <span style="color: #bc6ec5; font-weight: bold;">NELEM</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">x</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> / <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>x<span style="color: #67b11d;">)[</span><span style="color: #a45bad;">0</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

JNIEXPORT jstring <span style="color: #ce537a; font-weight: bold;">JNICALL</span> <span style="color: #bc6ec5; font-weight: bold;">get_hello</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span> *<span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #bc6ec5;">(</span>*env<span style="color: #bc6ec5;">)</span>-&gt;NewStringUTF<span style="color: #bc6ec5;">(</span>env, <span style="color: #2d9574;">"hello from jni"</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">JNINativeMethod</span> <span style="color: #7590db;">g_methods</span><span style="color: #4f97d7;">[]</span> = <span style="color: #4f97d7;">{</span>
        <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"getHello"</span>,     <span style="color: #2d9574;">"()Ljava/lang/String;"</span>, <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">void</span> *<span style="color: #2d9574;">)</span> get_hello<span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>;

JNIEXPORT <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #bc6ec5; font-weight: bold;">JNI_OnLoad</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JavaVM</span> *<span style="color: #7590db;">vm</span>, <span style="color: #ce537a; font-weight: bold;">void</span> *<span style="color: #7590db;">reserved</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">JNIEnv</span> *<span style="color: #7590db;">env</span> = <span style="color: #a45bad;">NULL</span>;
    <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #7590db;">result</span> = JNI_ERR;

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>*vm<span style="color: #2d9574;">)</span>-&gt;GetEnv<span style="color: #2d9574;">(</span>vm, <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">void</span> **<span style="color: #67b11d;">)</span> &amp;env, JNI_VERSION_1_6<span style="color: #2d9574;">)</span> != JNI_OK<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> JNI_ERR;
    <span style="color: #bc6ec5;">}</span>

    assert<span style="color: #bc6ec5;">(</span>env != <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span>;

    clazz = <span style="color: #bc6ec5;">(</span>*env<span style="color: #bc6ec5;">)</span>-&gt;FindClass<span style="color: #bc6ec5;">(</span>env, className<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>clazz == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> JNI_ERR;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">C &#19982; C++ &#19981;&#21516;&#20043;&#22788;,</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>*env<span style="color: #2d9574;">)</span>-&gt;RegisterNatives<span style="color: #2d9574;">(</span>env, clazz, gMethods, NELEM<span style="color: #67b11d;">(</span>gMethods<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> &lt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> JNI_ERR;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20195;&#34920; JNI &#19981;&#21516;&#30340;&#29256;&#26412;.</span>
    result = JNI_VERSION_1_6;

    <span style="color: #4f97d7; font-weight: bold;">return</span> result;
<span style="color: #4f97d7;">}</span>

</pre>
</div>


<p>
C++版本的动态注册如下所示：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span> *<span style="color: #7590db;">mainClass</span> = <span style="color: #2d9574;">"payegis/com/jstest/MainActivity"</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">path of Java file</span>

<span style="color: #bc6ec5;">#define</span> <span style="color: #bc6ec5; font-weight: bold;">NELEM</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">x</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span>x<span style="color: #2d9574;">)</span> / <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>x<span style="color: #67b11d;">)[</span><span style="color: #a45bad;">0</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>



JNIEXPORT jstring <span style="color: #ce537a; font-weight: bold;">JNICALL</span> <span style="color: #bc6ec5; font-weight: bold;">get_hello</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span> *<span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> env-&gt;NewStringUTF<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hello from jni"</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>


<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">JNINativeMethod</span> <span style="color: #7590db;">g_methods</span><span style="color: #4f97d7;">[]</span> = <span style="color: #4f97d7;">{</span>
        <span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"getHello"</span>,     <span style="color: #2d9574;">"()Ljava/lang/String;"</span>, <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">void</span> *<span style="color: #2d9574;">)</span> get_hello<span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>;


JNIEXPORT jint <span style="color: #ce537a; font-weight: bold;">JNICALL</span> <span style="color: #bc6ec5; font-weight: bold;">JNI_OnLoad</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JavaVM</span> *<span style="color: #7590db;">jvm</span>, <span style="color: #ce537a; font-weight: bold;">void</span> *<span style="color: #7590db;">reserved</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">JNIEnv</span> *<span style="color: #7590db;">env</span> = <span style="color: #a45bad;">NULL</span>;
    <span style="color: #ce537a; font-weight: bold;">jint</span> <span style="color: #7590db;">result</span> = JNI_FALSE;

    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#33719;&#21462;env&#25351;&#38024;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>jvm-&gt;GetEnv<span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">void</span> **<span style="color: #67b11d;">)</span> &amp;env, JNI_VERSION_1_6<span style="color: #2d9574;">)</span> != JNI_OK<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> result;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>env == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> result;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#33719;&#21462;&#31867;&#24341;&#29992;&#65292;&#20889;&#31867;&#30340;&#20840;&#36335;&#24452;&#65288;&#21253;&#21517;+&#31867;&#21517;&#65289;&#12290;FindClass&#31561;JNI&#20989;&#25968;&#23558;&#22312;&#21518;&#38754;&#35762;&#35299;</span>
    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span> = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>mainClass<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>clazz == <span style="color: #a45bad;">NULL</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> result;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27880;&#20876;&#26041;&#27861;</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>env-&gt;RegisterNatives<span style="color: #2d9574;">(</span>clazz, g_methods, NELEM<span style="color: #67b11d;">(</span>g_methods<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> &lt; <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> result;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25104;&#21151;</span>
    result = JNI_VERSION_1_6;
    <span style="color: #4f97d7; font-weight: bold;">return</span> result;
<span style="color: #4f97d7;">}</span>

</pre>
</div>
</div>
</div>
